OpenFOAM files/run/onlyOneTree/LAD5e10/LoD2/conifer_im/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    x0
    {
        type            symmetry;
        inGroups        List<word> 1(symmetry);
        nFaces          455;
        startFace       23251;
    }
    y0
    {
        type            patch;
        nFaces          234;
        startFace       23706;
    }
    x1
    {
        type            symmetry;
        inGroups        List<word> 1(symmetry);
        nFaces          455;
        startFace       23940;
    }
    y1
    {
        type            patch;
        nFaces          234;
        startFace       24395;
    }
    terrain
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          630;
        startFace       24629;
    }
    sky
    {
        type            symmetry;
        inGroups        List<word> 1(symmetry);
        nFaces          630;
        startFace       25259;
    }
)

// ************************************************************************* //
